---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.StructuralCustomConnectionFailures
source: html/904fb8e9-7133-2f3e-6acc-0d226bbe85f0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StructuralCustomConnectionFailures

Failures about StructuralConnectionHandler.

## Syntax (C#)
```csharp
public static class StructuralCustomConnectionFailures
```